[
    { "english": "I put avocado on my sandwich.", "french": "J'ai mis de l'avocat sur mon sandwich.", "italian": "Ho messo l'avocado nel mio panino." },
    { "english": "Zucchini is great in stir-fry.", "french": "La courgette est excellente dans un sauté.", "italian": "La zucchina è ottima nei saltati." },
    { "english": "Spinach can be added to smoothies.", "french": "Les épinards peuvent être ajoutés aux smoothies.", "italian": "Gli spinaci possono essere aggiunti ai frullati." },
    { "english": "Mushrooms are perfect for pizza.", "french": "Les champignons sont parfaits pour la pizza.", "italian": "I funghi sono perfetti per la pizza." },
    { "english": "Pumpkin soup is delicious in the fall.", "french": "La soupe à la citrouille est délicieuse en automne.", "italian": "La zuppa di zucca è deliziosa in autunno." },
    { "english": "Squash can be roasted or steamed.", "french": "La courge peut être rôtie ou cuite à la vapeur.", "italian": "La cucuzza può essere arrostita o cotta al vapore." },
    { "english": "Artichokes are great with lemon.", "french": "Les artichauts sont excellents avec du citron.", "italian": "I carciofi sono ottimi con il limone." },
    { "english": "Asparagus is a healthy side dish.", "french": "Les asperges sont un accompagnement sain.", "italian": "Gli asparagi sono un contorno sano." },
    { "english": "Peas add sweetness to dishes.", "french": "Les pois ajoutent de la douceur aux plats.", "italian": "I piselli aggiungono dolcezza ai piatti." },
    { "english": "Corn on the cob is a summer favorite.", "french": "Le maïs en épi est un favori de l'été.", "italian": "Il mais in spiga è un preferito estivo." },
    { "english": "Cabbage can be used in salads.", "french": "Le chou peut être utilisé dans les salades.", "italian": "Il cavolo può essere usato nelle insalate." },
    { "english": "Cauliflower makes a great rice substitute.", "french": "Le chou-fleur est un excellent substitut du riz.", "italian": "Il cavolfiore è un ottimo sostituto del riso." },
    { "english": "Broccoli is rich in vitamins.", "french": "Le brocoli est riche en vitamines.", "italian": "I broccoli sono ricchi di vitamine." },
    { "english": "Radishes add crunch to salads.", "french": "Les radis ajoutent du croquant aux salades.", "italian": "I ravanelli aggiungono croccantezza alle insalate." },
    { "english": "Celery is often used in soups.", "french": "Le céleri est souvent utilisé dans les soupes.", "italian": "Il sedano è spesso usato nelle zuppe." },
    { "english": "Beetroot can be roasted or pickled.", "french": "La betterave peut être rôtie ou marinée.", "italian": "La barbabietola può essere arrostita o sott'aceto." },
    { "english": "Sweet potatoes are a nutritious alternative.", "french": "Les patates douces sont une alternative nutritive.", "italian": "Le patate dolci sono un'alternativa nutriente." },
    { "english": "Chili peppers can make dishes spicy.", "french": "Les piments peuvent rendre les plats épicés.", "italian": "I peperoncini possono rendere i piatti piccanti." },
    { "english": "Olives are a common appetizer.", "french": "Les olives sont un apéritif courant.", "italian": "Le olive sono un antipasto comune." },
    { "english": "Capers add a tangy flavor to dishes.", "french": "Les câpres ajoutent une saveur piquante aux plats.", "italian": "I capperi aggiungono un sapore piccante ai piatti." },
    { "english": "Pickles are often served with sandwiches.", "french": "Les cornichons sont souvent servis avec des sandwiches.", "italian": "I sottaceti sono spesso serviti con i panini." },
    { "english": "Cucumbers are refreshing in salads.", "french": "Les concombres sont rafraîchissants dans les salades.", "italian": "I cetrioli sono rinfrescanti nelle insalate." },
    { "english": "Lettuce is the base of many salads.", "french": "La laitue est la base de nombreuses salades.", "italian": "La lattuga è la base di molte insalate." },
    { "english": "Radicchio adds a bitter taste to dishes.", "french": "Le radicchio ajoute un goût amer aux plats.", "italian": "Il radicchio aggiunge un sapore amaro ai piatti." },
    { "english": "Rosemary is perfect for roasted meats.", "french": "Le romarin est parfait pour les viandes rôties.", "italian": "Il rosmarino è perfetto per le carni arrosto." },
    { "english": "Thyme enhances the flavor of stews.", "french": "Le thym rehausse la saveur des ragoûts.", "italian": "Il timo esalta il sapore degli stufati." },
    { "english": "Basil is often used in Italian cuisine.", "french": "Le basilic est souvent utilisé dans la cuisine italienne.", "italian": "Il basilico è spesso usato nella cucina italiana." },
    { "english": "Oregano complements many Mediterranean dishes.", "french": "L'origan complète de nombreux plats méditerranéens.", "italian": "L'origano completa molti piatti mediterranei." },
    { "english": "Ginger adds a spicy kick to recipes.", "french": "Le gingembre ajoute un coup de piquant aux recettes.", "italian": "Lo zenzero aggiunge una nota piccante alle ricette." },
    { "english": "Turmeric is known for its vibrant color.", "french": "Le curcuma est connu pour sa couleur vive.", "italian": "La curcuma è conosciuta per il suo colore vivace." },
    { "english": "Cinnamon is used in both sweet and savory dishes.", "french": "La cannelle est utilisée dans les plats sucrés et salés.", "italian": "La cannella è usata sia nei piatti dolci che in quelli salati." },
    { "english": "Nutmeg can be used in baking and cooking.", "french": "La noix de muscade peut être utilisée en pâtisserie et en cuisine.", "italian": "La noce moscata può essere usata in cucina e in pasticceria." },
    { "english": "Cloves add a warm, aromatic flavor.", "french": "Les clous de girofle ajoutent une saveur chaude et aromatique.", "italian": "I chiodi di garofano aggiungono un sapore caldo e aromatico." },
    { "english": "Vanilla is a popular flavor for desserts.", "french": "La vanille est une saveur populaire pour les desserts.", "italian": "La vaniglia è un sapore popolare per i dolci." },
    { "english": "Almonds can be used in baking or eaten raw.", "french": "Les amandes peuvent être utilisées en pâtisserie ou consommées crues.", "italian": "Le mandorle possono essere usate in pasticceria o mangiate crude." },
    { "english": "Walnuts are great for adding crunch to salads.", "french": "Les noix sont excellentes pour ajouter du croquant aux salades.", "italian": "Le noci sono ottime per aggiungere croccantezza alle insalate." },
    { "english": "Cashews are a tasty snack on their own.", "french": "Les anacardes sont une collation savoureuse en soi.", "italian": "Gli anacardi sono uno snack gustoso da soli." },
    { "english": "Pistachios can be used in both sweet and savory dishes.", "french": "Les pistaches peuvent être utilisées dans des plats sucrés et salés.", "italian": "I pistacchi possono essere usati sia nei piatti dolci che salati." },
    { "english": "Sunflower seeds are a healthy snack option.", "french": "Les graines de tournesol sont une option de collation saine.", "italian": "I semi di girasole sono uno snack sano." },
    { "english": "Sesame seeds are often used in Asian cuisine.", "french": "Les graines de sésame sont souvent utilisées dans la cuisine asiatique.", "italian": "I semi di sesamo sono spesso usati nella cucina asiatica." },
    { "english": "Peanuts are a common ingredient in many recipes.", "french": "Les cacahuètes sont un ingrédient commun dans de nombreuses recettes.", "italian": "Le arachidi sono un ingrediente comune in molte ricette." },
    { "english": "Honey is a natural sweetener.", "french": "Le miel est un édulcorant naturel.", "italian": "Il miele è un dolcificante naturale." },
    { "english": "Maple syrup is often used on pancakes.", "french": "Le sirop d'érable est souvent utilisé sur les crêpes.", "italian": "Lo sciroppo d'acero è spesso usato sui pancake." },
    { "english": "Molasses is used in baking and cooking.", "french": "La mélasse est utilisée en pâtisserie et en cuisine.", "italian": "La melassa è usata nella cucina e nella pasticceria." },
    { "english": "Pasta sauce can be made from tomatoes.", "french": "La sauce pour pâtes peut être faite à partir de tomates.", "italian": "Il sugo per la pasta può essere fatto con pomodori." },
    { "english": "Soy sauce is a staple in many Asian dishes.", "french": "La sauce soja est un ingrédient de base dans de nombreux plats asiatiques.", "italian": "La salsa di soia è un ingrediente fondamentale in molti piatti asiatici." },
    { "english": "Vinegar is used to add acidity to dishes.", "french": "Le vinaigre est utilisé pour ajouter de l'acidité aux plats.", "italian": "L'aceto è usato per aggiungere acidità ai piatti." },
    { "english": "Mayonnaise is often used in sandwiches.", "french": "La mayonnaise est souvent utilisée dans les sandwiches.", "italian": "La maionese è spesso usata nei panini." },
    { "english": "Mustard can be spicy or mild.", "french": "La moutarde peut être épicée ou douce.", "italian": "La senape può essere piccante o delicata." },
    { "english": "Ketchup is a favorite condiment for burgers.", "french": "Le ketchup est un condiment préféré pour les burgers.", "italian": "Il ketchup è un condimento preferito per gli hamburger." },
    { "english": "Barbecue sauce adds a smoky flavor.", "french": "La sauce barbecue ajoute une saveur fumée.", "italian": "La salsa barbecue aggiunge un sapore affumicato." },
    { "english": "Sour cream is used in dips and sauces.", "french": "La crème aigre est utilisée dans les trempettes et les sauces.", "italian": "La panna acida è usata nelle salse e nelle salsine." },
    { "english": "Cream cheese is spread on bagels.", "french": "Le fromage à la crème est tartiné sur les bagels.", "italian": "Il formaggio cremoso è spalmato sui bagel." },
    { "english": "Ricotta cheese is used in lasagna.", "french": "Le fromage ricotta est utilisé dans les lasagnes.", "italian": "Il formaggio ricotta è usato nella lasagna." }
]
