[
    { "english": "I need a new armchair for the living room.", "french": "J'ai besoin d'un nouveau fauteuil pour le salon.", "italian": "Ho bisogno di una nuova poltrona per il soggiorno." },
    { "english": "The cupboard in the kitchen is full.", "french": "Le buffet dans la cuisine est plein.", "italian": "Il mobile in cucina è pieno." },
    { "english": "He bought a recliner for his home office.", "french": "Il a acheté un fauteuil inclinable pour son bureau à domicile.", "italian": "Ha comprato una poltrona reclinabile per il suo ufficio a casa." },
    { "english": "The bookcase is filled with novels.", "french": "La bibliothèque est remplie de romans.", "italian": "La libreria è piena di romanzi." },
    { "english": "She placed a side table next to the sofa.", "french": "Elle a placé une table d'appoint à côté du canapé.", "italian": "Ha messo un tavolino accanto al divano." },
    { "english": "The ottoman matches the sofa perfectly.", "french": "Le pouf s'accorde parfaitement avec le canapé.", "italian": "Il pouf si abbina perfettamente al divano." },
    { "english": "The chandelier is beautiful in the dining room.", "french": "Le chandelier est magnifique dans la salle à manger.", "italian": "Il lampadario è bello nella sala da pranzo." },
    { "english": "We need to organize the dresser in the bedroom.", "french": "Nous devons organiser la commode dans la chambre.", "italian": "Dobbiamo organizzare il comò nella camera da letto." },
    { "english": "The blinds are too thick for the sunlight.", "french": "Les stores sont trop épais pour la lumière du soleil.", "italian": "Le tende sono troppo spesse per la luce solare." },
    { "english": "I put the nightstand next to my bed.", "french": "J'ai mis la table de nuit à côté de mon lit.", "italian": "Ho messo il comodino accanto al mio letto." },
    { "english": "The coat rack is in the hallway.", "french": "Le porte-manteau est dans le couloir.", "italian": "L'attaccapanni è nell'ingresso." },
    { "english": "I swept the floor with the broom.", "french": "J'ai balayé le sol avec le balai.", "italian": "Ho spazzato il pavimento con la scopa." },
    { "english": "The mop is in the storage closet.", "french": "La serpillière est dans le placard de rangement.", "italian": "Il mocio è nell'armadio di stoccaggio." },
    { "english": "The dustpan is next to the broom.", "french": "Le ramasse-poussière est à côté du balai.", "italian": "La paletta è accanto alla scopa." },
    { "english": "The dish rack is drying the dishes.", "french": "L'égouttoir sèche la vaisselle.", "italian": "Il sgocciolatoio sta asciugando i piatti." },
    { "english": "She used a spatula to flip the pancakes.", "french": "Elle a utilisé une spatule pour retourner les crêpes.", "italian": "Ha usato una spatola per girare i pancake." },
    { "english": "The peeler is sharp and efficient.", "french": "L'éplucheur est tranchant et efficace.", "italian": "Il pelapatate è affilato ed efficiente." },
    { "english": "He grated cheese with the grater.", "french": "Il a râpé du fromage avec la râpe.", "italian": "Ha grattugiato il formaggio con la grattugia." },
    { "english": "The colander is for rinsing vegetables.", "french": "La passoire est pour rincer les légumes.", "italian": "Il colino è per sciacquare le verdure." },
    { "english": "She used a sieve to strain the sauce.", "french": "Elle a utilisé un tamis pour filtrer la sauce.", "italian": "Ha usato un setaccio per filtrare la salsa." },
    { "english": "The can opener is on the kitchen counter.", "french": "L'ouvre-boîte est sur le plan de travail de la cuisine.", "italian": "L'apriscatole è sul piano della cucina." },
    { "english": "The bottle opener is in the drawer.", "french": "Le décapsuleur est dans le tiroir.", "italian": "Il cavatappi è nel cassetto." },
    { "english": "I measured flour with the measuring cup.", "french": "J'ai mesuré de la farine avec la tasse à mesurer.", "italian": "Ho misurato la farina con il misurino." },
    { "english": "The grill is perfect for outdoor cooking.", "french": "Le gril est parfait pour la cuisson en extérieur.", "italian": "La griglia è perfetta per cucinare all'aperto." },
    { "english": "The pots and pans are in the cabinet.", "french": "Les casseroles et poêles sont dans le placard.", "italian": "Le pentole e padelle sono nell'armadietto." },
    { "english": "She baked cookies on the baking tray.", "french": "Elle a cuit des biscuits sur la plaque de cuisson.", "italian": "Ha cotto i biscotti nella teglia." },
    { "english": "The rolling pin is used for dough.", "french": "Le rouleau à pâtisserie est utilisé pour la pâte.", "italian": "Il mattarello è usato per la pasta." },
    { "english": "The toaster oven is great for small meals.", "french": "Le four grille-pain est idéal pour les petits repas.", "italian": "Il forno tostapane è ottimo per i pasti piccoli." },
    { "english": "She made coffee with the coffee maker.", "french": "Elle a fait du café avec la machine à café.", "italian": "Ha preparato il caffè con la macchina da caffè." },
    { "english": "The blender is on the kitchen counter.", "french": "Le mixeur est sur le plan de travail de la cuisine.", "italian": "Il frullatore è sul piano della cucina." },
    { "english": "The ice maker is in the freezer.", "french": "La machine à glaçons est dans le congélateur.", "italian": "La macchina per il ghiaccio è nel congelatore." },
    { "english": "The water heater is in the basement.", "french": "Le chauffe-eau est dans le sous-sol.", "italian": "Lo scaldabagno è nel seminterrato." },
    { "english": "The fireplace keeps the room warm.", "french": "La cheminée garde la pièce au chaud.", "italian": "Il camino tiene la stanza calda." },
    { "english": "They use a wood stove for heating.", "french": "Ils utilisent un poêle à bois pour chauffer.", "italian": "Usano una stufa a legna per riscaldare." },
    { "english": "The air conditioner is broken.", "french": "Le climatiseur est cassé.", "italian": "Il condizionatore è rotto." },
    { "english": "The heater is running all night.", "french": "Le radiateur fonctionne toute la nuit.", "italian": "Il riscaldatore è acceso tutta la notte." },
    { "english": "The dehumidifier is in the laundry room.", "french": "Le déshumidificateur est dans la buanderie.", "italian": "Il deumidificatore è nella lavanderia." },
    { "english": "The humidifier helps with dry air.", "french": "L'humidificateur aide avec l'air sec.", "italian": "L'umidificatore aiuta con l'aria secca." },
    { "english": "The book shelf is full of novels.", "french": "L'étagère à livres est pleine de romans.", "italian": "Lo scaffale per libri è pieno di romanzi." },
    { "english": "The pillowcase needs to be washed.", "french": "La housse de coussin doit être lavée.", "italian": "La federa del cuscino deve essere lavata." },
    { "english": "The bedspread matches the curtains.", "french": "La housse de lit s'accorde avec les rideaux.", "italian": "Il copripiumino si abbina alle tende." },
    { "english": "I need a new blanket for winter.", "french": "J'ai besoin d'une nouvelle couverture pour l'hiver.", "italian": "Ho bisogno di una nuova coperta per l'inverno." },
    { "english": "The sheet is wrinkled after washing.", "french": "Le drap est froissé après le lavage.", "italian": "Il lenzuolo è stropicciato dopo il lavaggio." },
    { "english": "The mattress is very comfortable.", "french": "Le matelas est très confortable.", "italian": "Il materasso è molto comodo." },
    { "english": "The comforter is soft and warm.", "french": "La couette est douce et chaude.", "italian": "Il piumone è morbido e caldo." },
    { "english": "The alarm clock woke me up early.", "french": "Le réveil m'a réveillé tôt.", "italian": "La sveglia mi ha svegliato presto." },
    { "english": "The shower curtain is blue and white.", "french": "Le rideau de douche est bleu et blanc.", "italian": "La tenda da doccia è blu e bianca." },
    { "english": "The bath mat is soft underfoot.", "french": "Le tapis de bain est doux sous les pieds.", "italian": "Il tappetino da bagno è morbido sotto i piedi." },
    { "english": "The toilet brush needs to be replaced.", "french": "La brosse de toilettes doit être remplacée.", "italian": "La spazzola per WC deve essere sostituita." },
    { "english": "The laundry basket is full of clothes.", "french": "Le panier à linge est plein de vêtements.", "italian": "Il cesto della biancheria è pieno di vestiti." },
    { "english": "The drying rack is set up in the garage.", "french": "L'étagère à linge est installée dans le garage.", "italian": "Lo stendibiancheria è sistemato in garage." },
    { "english": "She ironed her clothes on the ironing board.", "french": "Elle a repassé ses vêtements sur la planche à repasser.", "italian": "Ha stirato i suoi vestiti sull'asse da stiro." },
    { "english": "The washing machine is broken again.", "french": "La lave-linge est encore en panne.", "italian": "La lavatrice è di nuovo rotta." },
    { "english": "The dryer is noisy when it runs.", "french": "Le sèche-linge est bruyant lorsqu'il fonctionne.", "italian": "L'asciugatrice è rumorosa quando è in funzione." },
    { "english": "The clothesline is in the backyard.", "french": "Le fil à linge est dans le jardin.", "italian": "Il stendibiancheria è nel cortile." },
    { "english": "She bought laundry detergent in bulk.", "french": "Elle a acheté du détergent pour lessive en gros.", "italian": "Ha comprato detersivo per bucato in grandi quantità." },
    { "english": "The dish soap is next to the sink.", "french": "Le liquide vaisselle est à côté de l'évier.", "italian": "Il detergente per piatti è accanto al lavandino." },
    { "english": "The scrub brush is used for tough stains.", "french": "La brosse est utilisée pour les taches tenaces.", "italian": "La spazzola è usata per le macchie difficili." },
    { "english": "The sponge is in the kitchen drawer.", "french": "L'éponge est dans le tiroir de la cuisine.", "italian": "La spugna è nel cassetto della cucina." },
    { "english": "The vacuum cleaner is in the closet.", "french": "L'aspirateur est dans le placard.", "italian": "L'aspirapolvere è nell'armadio." },
    { "english": "I used the broom to sweep the porch.", "french": "J'ai utilisé le balai pour balayer le porche.", "italian": "Ho usato la scopa per spazzare il portico." },
    { "english": "The dustpan was broken, so I used a piece of paper.", "french": "Le ramasse-poussière était cassé, alors j'ai utilisé un morceau de papier.", "italian": "La paletta era rotta, così ho usato un pezzo di carta." },
    { "english": "The trash can is full and needs to be emptied.", "french": "La poubelle est pleine et doit être vidée.", "italian": "Il cestino è pieno e deve essere svuotato." },
    { "english": "The recycling bin is for paper and plastic.", "french": "Le bac de recyclage est pour le papier et le plastique.", "italian": "Il bidone per la raccolta differenziata è per la carta e la plastica." },
    { "english": "The doormat is muddy from the rain.", "french": "Le tapis de porte est boueux à cause de la pluie.", "italian": "Il tappetino d'ingresso è fangoso a causa della pioggia." }
]
